[
  {
    "title": "First step of something",
    "date": "2025-05-23",
  "blogContent": "First of all, hello and welcome to my personal website (or whatever this is)!\n\nWho am I, you might ask? My name is Sindri, and from today (23rd of May), I’m officially a junior .NET developer. I’ve spent the last two years studying to become a developer after switching paths from carpentry, which I did for 13 years.\n\nWhy the change? Well, even though I loved carpentry, it started to feel like I was stuck on repeat. Everything was local, I never really left the town I lived in, and after a while, it felt like my personal development had come to a halt. I wasn’t growing, learning new things, or being challenged the way I wanted to. I needed something new — a change of scenery, a fresh start, and a new kind of everyday life.\n\nSo becoming a developer felt like the natural choice. I’ve always been interested in STEM-related stuff, and most of what I’ve consumed online has been around that. I also love building and creating, whether it’s houses, furniture, or now, software.\n\nSo yeah, that’s a short intro to who I am and why I’m here, taking up a little corner of the internet.\n\nWhat’s this site for?\n\nWell, like I said, this is going to be my portfolio, but also kind of a blog. I’ll be writing about the progress I make on this site, other projects I’m working on, and maybe just some general thoughts, a mix between a dev diary and a regular blog, I guess.\n\nSo, what have I done so far?\n\nAs you can probably tell, not a whole lot yet. I just set up the project, wrote this post, and got the site published. That’s it. But it’s a start!\n\nI’m building this site using Next.js. As a .NET developer, I could’ve used Blazor, and honestly, I thought about it, but I wanted to push myself a bit. I’ve got some basic knowledge of JavaScript and React, so now that I feel more confident with C#, I figured it’s time to sharpen those frontend tools. And what better way than by building my own site?\n\nWhat’s the plan?\n\nThere’s no real plan yet, this whole thing was kind of a spontaneous decision. I have a mental image of what I want this site to look like, but nothing written in stone.\n\nThe idea is to make it look a bit like an API testing interface. Each page would be like a separate URL or endpoint, with different content. Might sound a bit weird now, but hopefully, I can bring that idea to life as I go.\n\nThat’s it for now! Thanks for reading, more stuff coming soon (hopefully)!"
  }
]
